{
  "_name_or_path": "cointegrated/rubert-tiny-toxicity",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "non-toxic",
    "1": "insult",
    "2": "obscenity",
    "3": "threat",
    "4": "dangerous"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "dangerous": 4,
    "insult": 1,
    "non-toxic": 0,
    "obscenity": 2,
    "threat": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29564
}
